export const question = () => {
  return [
    {
      title: '支援哪些裝置與瀏覽器？',
      term: [
        {
          termTitle:
            '線上閱讀觀看，建議使用最新版本 Chrome、Firefox、Safari、Microsoft Edge瀏覽器。',
        },
        {
          termTitle: '行動裝置（手機/平板）需iOS 14或Android 7以上系統。',
        },
      ],
    },
    {
      title: '如何註冊帳號？',
      term: [
        {
          termTitle: '可使用Email建立專屬帳號。',
        },
        {
          termTitle: '企業採購或團體方案需聯繫客服support@unlocking.today。',
        },
      ],
    },
    {
      title: '如何購買電子書、有聲書或課程？',
      term: [
        {
          termTitle: '選擇商品加入購物車，確認數量後點選「結帳」。',
        },
        {
          termTitle: '選擇支付方式（信用卡、銀聯卡）。',
        },
        {
          termTitle: '付款成功後，系統將自動開通內容權限，並寄送電子發票至註冊信箱。',
        },
      ],
    },
    {
      title: '購買後如何存取內容？',
      term: [
        {
          termTitle: '登入帳號後，至「我的書櫃」或「我的觀看」查看已購內容。',
        },
        {
          termTitle: '電子書/有聲書： 可線上閱讀。',
        },
        {
          termTitle: '線上課程： 可無限次觀看，部分課程提供學習期限（詳見商品說明）。',
        },
      ],
    },
    {
      title: '支付失敗怎麼辦？',
      term: [
        {
          termTitle: '確認信用卡資訊是否正確，或額度是否充足。',
        },
        {
          termTitle: '若持續失敗，請聯繫客服support@unlocking.today。',
        },
      ],
    },
    {
      title: '如何申請退款？',
      term: [
        {
          termTitle: '數位商品原則上不提供退款，例外情況如下：',
          termContent: [
            '重複扣款或系統錯誤導致購買失敗。',
            '課程內容與描述嚴重不符（需提供證明）。',
          ],
        },
        {
          termTitle:
            '申請方式：至客服support@unlocking.today提交訂單編號與問題說明，3 個工作天內回覆處理情況。',
        },
      ],
    },
    {
      title: '如何取得電子發票？',
      term: [
        {
          termTitle: '完成付款後，系統自動寄送電子發票至註冊信箱。',
        },
        {
          termTitle: '可至聯絡客服support@unlocking.today修改發票類型（個人/公司戶）。',
        },
      ],
    },
    {
      title: '能否分享帳號或轉售內容？',
      term: [
        {
          termTitle: '帳號僅限本人使用，禁止轉售、出租或多人共用。',
        },
        {
          termTitle: '電子書/有聲書禁止非法複製與散播。',
        },
      ],
    },
    {
      title: '線上課程是否有觀看期限？',
      term: [
        {
          termTitle:
            '大部分課程為「永久觀看」，但部分合作講師可能設定時限（例：2 年），請詳閱商品頁面說明。',
        },
      ],
    },
    {
      title: '發現內容有誤或無法播放？',
      term: [
        {
          termTitle:
            '請截圖並提供裝置型號、作業系統版本，寄至客服信箱support@unlocking.today，我們將優先處理。',
        },
      ],
    },
    {
      title: '忘記密碼怎麼辦？',
      term: [
        {
          termTitle: '於登入頁面點選「忘記密碼」，輸入註冊信箱收取重設連結。',
        },
      ],
    },
    {
      title: '如何聯繫客服？',
      term: [
        {
          termTitle: '客服信箱： support@unlocking.today',
        },
        {
          termTitle: '服務時間： 週一至週五 09:00-18:00（國定假日休息）',
        },
      ],
    },
    {
      title: '我是創作者，如何上架作品？',
      term: [
        {
          termTitle:
            '歡迎作者、講師與出版社合作！請備妥作品大綱與試閱檔，寄至客服信箱，審核通過後將由專人聯繫。',
        },
      ],
    },
    {
      title: '企業團購或教育訓練方案？',
      term: [
        {
          termTitle: '提供企業專屬採購報價與帳號管理後台，請與客服聯繫。',
        },
      ],
    },
    {
      title: '課程影片是否支援電視播放？',
      term: [
        {
          termTitle: '電視內建瀏覽器可直接登入網站觀看。, 任何手機或電腦有此投放功能均可。',
        },
      ],
    },
    {
      title: '更換裝置後需重新購買內容嗎？',
      term: [
        {
          termTitle: '不需要！所有內容均綁定帳號，登入後即可存取。',
        },
      ],
    },
    {
      title: '平台如何保護我的個資與支付安全？',
      term: [
        {
          termTitle: '支付全程透過綠界 ECPay 加密處理，平台不儲存信用卡資訊。',
        },
        {
          termTitle: '隱私政策符合 GDPR 規範，詳見隱私權條款。',
        },
      ],
    },
    {
      title: '如何獲取最新消息與優惠？',
      term: [
        {
          termTitle: '關注官方社群（Facebook/Instagram/Line）獲取限時折扣碼。',
        },
      ],
    },
    {
      title: '還有其他問題？',
      term: [
        {
          termTitle: '歡迎透過以下管道聯繫，客服信箱： support@unlocking.today',
        },
      ],
    },
  ];
};

export const serviceTerm = () => {
  return [
    {
      title: '認知與接受條款',
      titleDescription: [
        '歡迎您使用由「愛特盟科技有限公司」（以下稱「本公司」）負責經營之解鎖平台：http://www.unlocking.today（以下稱「本網站」）。本網站提供優質提案者做為各類知識傳遞之平台，並提供本網站會員相關服務（以下稱「本服務」）。您加入成為本網站會員毋需任何費用，您透過單一的解鎖會員帳號即可使用本服務。本服務條款構成會員與本公司之間的契約，當您完成註冊手續或開始使用本服務時，即表示您已閱讀、瞭解並同意接受本服務條款之所有內容。您於任何修改或變更後繼續使用本服務，視為您已閱讀、瞭解並同意接受該等修改或變更。',
        '如果您不同意本服務條款的內容，或者您所屬的國家或地域排除本服務條款內容之全部或一部時，您應立即停止使用本服務。如您是無行為能力人或限制行為能力人（如未滿十八歲之未成年人），則您在加入會員前，請將本服務條款交由您的法定代理人（如父母、輔助人或監護人）閱讀，並得到其同意，您才可註冊及使用本服務。當您開始使用或繼續使用本服務時，則表示您的法定代理人（如父母、輔助人或監護人）已經閱讀、了解並同意本服務條款及其後修改變更。',
      ],
    },
    {
      title: '個人資料之蒐集、處理及利用之告知',
      titleDescription: [
        '本網站為了確保會員之個人資料、隱私及消費者權益之保護，於交易過程中將使用會員之個人資料，謹依個人資料保護法第8條規定告知以下事項：',
      ],
      term: [
        {
          termTitle: '蒐集主體：愛特盟科技有限公司',
        },
        {
          termTitle: '蒐集之目的',
          termDescription: [
            '本公司蒐集之目的包括行銷、契約、類似契約或其他法律關係事務、消費者、客戶管理與服務、消費者保護、網路購物及其他電子商務服務、統計與研究分析，及其他經營合於營業登記項目或組織章程所定之業務，及人工智慧技術應用權（包含但不限於將內容作為 AI 訓練資料、透過 AI 技術進行內容轉換、重製或改作，以及將內容應用於 AI 相關產品或服務）。本公司將在會員之加入會員之流程、進行交易之流程，及閱讀、瀏覽網頁過程中，進行資料之蒐集。',
          ],
        },
        {
          termTitle: '個人資料類別',
          termDescription: ['本公司於網站及服務中蒐集之資料包括以下數種'],
          termContent: [
            '辨識個人者：如會員之姓名、地址、電話號碼、電子郵件信箱等。',
            '辨識財務者：如銀行帳戶資訊、信用卡或簽帳卡之號碼。',
            '其他：本公司系統因您登入、使用閱讀軟體等所自動蒐集之資料。此外，基於課程管理、分析效能以及進行研究等需要，本公司將蒐集、處理並利用會員個人資料：包括但不限於講師互動、記錄出席狀況等。本公司對因提供服務而知悉或持有會員之課程及訂購紀錄或其他個人資料負有保密義務，除會員要求查詢或第三人依據個人資料保護相關法令情求查詢外，本公司將不會對任何第三人揭露。',
          ],
        },
        {
          termTitle: '個人資料利用之期間、地區、對象及方式',
          termContent: [
            '期間：本公司營運期間。',
            '地區：會員之個人資料將用於台灣地區及本公司伺服器、備援伺服器所在地區。',
            '利用對象及方式：您的個人資料僅於利用目的必要範圍內供本公司及協力廠商以電子或紙本方式處理及利用，並將不會提供予任何無關之第三人。',
          ],
        },
        {
          termTitle: '會員對個人資料之權利：依個人資料保護法規定，您對本公司有以下權利',
          termContent: [
            '請求提供查詢或閱覽。',
            '請求製給複製本。',
            '請求補充缺漏或更正錯誤。',
            '請求停止蒐集、處理或利用。',
            '請求刪除。',
          ],
        },
      ],
    },
    {
      titleDescription: [
        '您如欲行使上述權利，可洽詢本公司客服support@unlocking.today，依本公司相關程序進行申請。',
        '如您拒絕提供本服務所需必要之資料，將可能導致無法享受完整服務或完全無法使用該項服務。',
      ],
    },
    {
      title: '會員服務',
      titleDescription: [
        '一旦本服務完成並確認您的申請後，將提供予您的會員服務內容有：線上創作、線上閱讀、個人書櫃、畫線、註記、回應、社群分享或其他未來可能新增之一般會員服務。會員服務僅依當時所提供之功能及狀態提供服務；本公司並保留新增、修改或取消會員服務內相關系統或功能之權利。會員服務之始期，係自使用者填妥申請資料並完成註冊程序後，本服務於完成相關系統設定、使會員服務達於可供使用之日開始。',
        '如您有購買或使用付費服務，您必須即時提供購買流程中所要求之資料，為適切地提供您相關服務，您並應擔保您所提供的所有資料，都是正確且即時的資料，如果您所留存的資料事後有變更，您應立即更新您所留存的資料。若您所提供的資料與事實不符；或所提供的資料業已變更而未更新；或有任何誤導之嫌，而導致無法為您提供或繼續提供服務，本公司不因此承擔任何責任。因會員服務所提供之所有相關網域名稱、網路位址、功能以及其他一切因會員身分得使用之權益，均仍屬本公司或其他合法權利人所有，會員僅得於服務期間內依本服務條款之約定為使用，不得以任何方式將其會員權益轉讓、移轉、出租或出借予其他任何第三人。',
        '本服務之線上課程、電子書及有聲書服務，係與您的會員帳戶使用權限相連結，如您喪失會員資格（例如：主動終止會員服務，或因違約致本公司終止會員帳戶），您即無法使用您所購買或無償取得之線上課程、電子書及有聲書。您認知並了解線上課程、電子書及有聲書服務可能因為著作權人或出版社契約之安排或侵權之糾紛，而可能有下架或其他無法繼續提供服務之情事，您同意如有前開情事發生而本公司須配合處理者，本公司將以為您取得該線上課程、電子書及有聲書所支付之對價作為對您所負之最大責任。',
      ],
    },
    {
      title: '資訊接收',
      titleDescription: [
        '本服務及本服務之閱讀系統會將與數位內容及會員使用相關之資訊（諸如線上課程最後聆聽的頁面、電子書與有聲書最後閱讀之頁面、庫藏之內容等）提供予本公司，包括畫線、註記、書籤、筆記、評論等由您使用本公司服務所留下之內容及資訊，將可能被儲存於您居住地之外的海外伺服器，本公司因此所接收之任何資訊，皆適用於本公司之隱私權條款。您需對您在本服務及閱讀系統所提供所有資訊負責，您對任何第三方所提供之資訊將適用該第三方所提供之隱私權政策或任何相關之規定，且不適用於本公司之隱私權政策。',
      ],
    },
    {
      title: '知識論壇特別約定',
      titleDescription: [
        '知識論壇提供會員創作發表平台，只有您自行創作或是有合法授權可以發表之內容，方可透過知識論壇發表。如您發表之內容有侵害他人法律權益，由您自負相關法律責任，並與本公司無關。您聲明並同意將您於知識論壇所發表的內容，授權本公司不受時間、地點之限制，透過知識論壇授權予使用者瀏覽、下載及其他個人目的、非公開、非營利之利用，本公司並得為行銷知識論壇目的，將您所發表的內容摘錄部分作為廣宣之用。如您欲終止前開授權，得以移除您發表之內容的方式為之，並在移除後始發生終止之效力。',
        '會員聲明並保證您所發表的內容，應依兒童及少年福利與權益保障法為適當分級，如涉有不適合兒童及青少年閱覽之暴力、血腥、色情、猥褻、賭博之內容，應標示為限制級，且不得有違法或侵害他人權益之情事。',
        '若您無合法權利得為前開授權或涉有違法情事之內容，請勿擅自將該內容上載、傳送、輸入或發表於知識論壇。',
        '如有違反前開保證，會員須賠償本公司因此所生之損害（含合理律師費用）。本公司並得視情況停止該內容之傳送，並採取相應之行動與處理，包括但不限於將您停權，使您無法繼續使用本服務之一部或全部，及保存所有相關電子記錄、個人資料檔案，並在必要時採取相應之法律行動。',
        '若知識論壇中之任何內容涉有侵害您的著作權，請您提供下列資料及聲明，並透過客服電子郵件（support@unlocking.today）方式通知本公司處理：',
      ],
      term: [
        {
          termTitle:
            '著作權人之簽名、或著作權人之代理人之簽名、相關權利證明文件及著作權之內容，例如：已發行書籍之封面及相關頁面、發表於網路中之網頁內容列印紙本及其網址。',
        },
        {
          termTitle: '侵害著作權之內容發表者帳號、書名或篇章名稱。',
        },
        {
          termTitle: '您的聯絡地址、電話等資料。',
        },
        {
          termTitle: '書面聲明您確信該網頁內容的使用行為是未經過著作權人、其代理人或法律的授權。',
        },
        {
          termTitle:
            '書面聲明您於通知書所載相關資料均為真實，且您是著作權人或著作權人之代理人而為上開聲明。',
        },
        {
          termTitle:
            '本公司在接獲通知後，將儘速以電子郵件將您的通知書轉知該會員並要求會員於三日內做出回覆説明，若該會員未於三天內回覆者，本公司將移除該涉及侵權之內容；若該會員涉有三次侵權情形，且未為合理說明或道歉者，本公司將終止該會員帳號使用知識論壇發表作品之資格。',
        },
      ],
    },
    {
      titleDescription: [
        '另基於個人資料保護法及本公司「隱私權政策」規定，除經使用者同意或於提供服務之目的外，本公司僅得依法令或政府機關之要求，提供使用者之識別資料予第三人。您如依前開規定提出涉有侵權的檢舉，本公司僅會依您的請求移除或屏蔽該侵權內容，而不會提供任何有關該使用者之識別資料。如欲取得該使用者之資料，應向地方法院檢察署或刑事警察局提出告訴，本公司將依前開有權單位來函要求提供使用者資料。請勿直接向本公司索取涉有侵權之會員之個人資料，以免不必要之誤解。',
      ],
    },
    {
      title: '帳號、密碼與安全性',
      titleDescription: [
        '在您使用會員服務以前，必須經過本服務所定的註冊手續，在註冊過程中您必須填入完整、而且正確的資料。如因資料錯誤或未更新所造成的任何問題，您須自行負擔責任。',
        '對於您所取得的使用者名稱和密碼，您必須負妥善保管和保密的義務，並應為使用此使用者名稱和密碼登入後於本服務之一切行為負責。建議於使用完畢後確實登出，並請勿轉讓、出借予第三者使用，如果您的這個使用者名稱和密碼被其他人冒用或不當使用，請儘速告知本服務客服人員協助您解決，但不對您負有任何形式之賠償或補償之責任或義務。',
        '請維持並更新您個人資料，確保其為正確、最新及完整。若您提供任何錯誤、不實或不完整的資料，本服務有權暫停或終止您的帳號，並拒絕您使用本服務之全部或一部份。',
      ],
    },
    {
      title: '隱私權政策',
      titleDescription: [
        '本網站依個人資料保護法及隱私權政策保護所有會員的隱私，不管是申請帳號、個人資料或所儲存的網站資料，除了可能涉及違法、侵權、或違反服務條款、或經本人同意以外，本網站不會任意監視、增刪、修改或關閉，或將個人資料內容交予第三者，包括贊助之廣告廠商。',
        '會員服務中若有與其他合作廠商或夥伴所共同經營者，會特別揭露合作廠商或夥伴的資訊，如果您不願將自身個人資料揭露給其他合作廠商，您可以選擇不使用這些特定服務，但如您開始使用這些特定服務，即表示您同意將個人資料提供給該特定服務之合作廠商；本網站將在資料蒐集或傳輸前明確告知您，再將您的個人資料揭露給該特定服務之合作廠商。',
        '您同意在下列的情況下，本網站有可能會查看或提供您的個人資料給法院、主管機關、或提出適當證明主張其權利受侵害之第三人：',
      ],
      term: [
        {
          termTitle: '因法令或依司法行政機關之命令。',
        },
        {
          termTitle: '為執行本會員服務條款之需要。',
        },
        {
          termTitle: '為維護會員服務系統的正常運作與安全。',
        },
        {
          termTitle: '為保護其他使用者或其他第三人的合法權益。',
        },
      ],
    },
    {
      title: '與第三方網站的連結',
      titleDescription: [
        '本網站或協力廠商可能會提供連結至其他網站或網路資源的連結。您可能會因此連結至其他業者經營的網站，其他業者經營的網站均由各該業者自行負責，不屬本服務控制及負責範圍之內，您仍需自行判斷繼續使用其他業者經營網站的服務是否合宜或合法。本網站對任何外部連結，不擔保其合適性、穩定性、即時性、有效性、正確性及完整性。',
        '您也許會連結到一些令您厭惡或不需要的網站，這是網際網路運作的可能結果，遇到此類情形時，本公司建議您不要瀏覽或儘速離開該等網站。您並同意本公司無需為您自行連結至非屬於本服務之網站所生之任何損害，負損害賠償之責任。',
      ],
    },
    {
      title: '兒童及青少年之保護',
      titleDescription: [
        '兒童及青少年上網已成趨勢，然而網路上的確存有不適宜兒童及青少年接受的訊息，例如色情與暴力的訊息，兒童及青少年有可能因此受到心靈與肉體上的傷害。因此，為確保兒童及青少年使用網路的安全，並避免隱私權受到侵犯，本服務除會針對內容主動分級、設立檢舉管道移除不適當的資訊外，家長（或監護人）應盡到下列義務：',
        '先檢閱網站是否有保護個人資料的隱私權政策，再決定是否同意提出相關的個人資料；並應持續叮嚀兒童及青少年不可洩漏自己或家人的任何資料（包括姓名、地址、電話、電子郵件信箱、照片、信用卡號等）給任何人。',
        '謹慎選擇合適網站供兒童及青少年瀏覽。未滿十二歲之兒童上網時，應全程在旁陪伴，十二歲以上未滿十八歲之青少年上網前亦應斟酌是否給予同意。',
      ],
    },
    {
      title: '使用者的守法義務及承諾',
      titleDescription: [
        '您承諾絕不為任何非法目的或以任何非法方式使用本網站及本服務，並承諾遵守中華民國相關法規及一切使用網際網路之國際慣例。您若係中華民國以外之使用者，並同意遵守所屬國家或地域之法令。您同意並保證不得利用本網站或本服務從事侵害他人權益或違法之行為，包括但不限於：',
      ],
      term: [
        {
          termTitle:
            '上載、張貼、公布或傳送任何誹謗、侮辱、具威脅性、攻擊性、不雅、猥褻、不實、違反公共秩序或善良風俗或其他不法之文字、圖片或任何形式的檔案於本網站或本服務上。',
        },
        {
          termTitle:
            '侵害他人名譽、隱私權、營業秘密、商標權、著作權、專利權、其他智慧財產權及其他權利。',
        },
        {
          termTitle: '違反依法律或契約所應負之保密義務。',
        },
        {
          termTitle: '冒用他人名義使用本網站或本服務。',
        },
        {
          termTitle:
            '上載、張貼、傳輸或散布任何含有電腦病毒或任何對電腦軟、硬體產生中斷、破壞或限制功能之程式碼之資料。',
        },
        {
          termTitle: '從事不法交易行為或張貼虛假不實、引人犯罪之訊息。',
        },
        {
          termTitle: '販賣槍枝、毒品、禁藥、盜版軟體或其他違禁物。',
        },
        {
          termTitle: '提供賭博資訊或以任何方式引誘他人參與賭博。',
        },
        {
          termTitle: '濫發廣告郵件、垃圾郵件、連鎖信、違法之多層次傳銷訊息等。',
        },
        {
          termTitle: '以任何方法傷害未成年人。',
        },
        {
          termTitle: '偽造訊息來源或以任何方式干擾傳輸來源之認定。',
        },
        {
          termTitle:
            '干擾或中斷本網站或本服務或伺服器或連結本網站或本服務之網路，或不遵守連結至本網站或本服務之相關需求、程序、政策或規則等。',
        },
        {
          termTitle: '對於恐怖行動提供任何實質支持或資源。',
        },
        {
          termTitle: '追蹤他人或其他干擾他人或為前述目前蒐集或儲存他人之個人資訊。',
        },
        {
          termTitle: '其他本網站或本服務有正當理由認為不適當之行為。',
        },
        {
          termTitle: '追蹤他人或其他干擾他人或為前述目前蒐集或儲存他人之個人資訊。',
        },
        {
          termTitle:
            '本網站及本服務並未針對會員所傳送、張貼或發表之內容做任何形式或實質之審查，如果任何文字、圖檔、圖片或其他著作或資料發生權利歸屬或其他合法性爭議，本網站及本服務有權隨時不經通知，直接停止提供會員服務、或直接刪除該文字、圖檔、圖片或其他著作或資料、或通知會員停止使用會員服務。',
        },
        {
          termTitle:
            '若有發現任何色情、侮辱、誹謗等不合規定的內容，本網站及本服務將立即刪除，並砍除帳號，不另通知。',
        },
      ],
    },
    {
      title: '您對本公司之授權',
      titleDescription: [
        '您所上載、傳送、輸入或提供予本公司之任何資料，其權利仍為您或您的授權人所有。您上載、傳送、輸入或提供予本公司的資料時，表示您已同意授權本公司可基於公益、宣傳推廣本公司、本網站及本服務之目的進行使用、修改、重製、公開播送、改作、散布、發行、公開發表、公開傳輸、公開上映、翻譯該等資料，並得在此範圍內將前述權利轉授權他人。您並保證本公司使用、修改、重製、公開播送、改作、散布、發行、公開發表、公開傳輸、公開上映、翻譯、轉授權該等資料，不致侵害任何第三人之智慧財產權，否則應對本公司負損害賠償責任。',
        '您同意如果您在會員服務上所刊載、傳輸、發送或儲存的檔案或資料，有任何違反法令、違反本服務條款、或有侵害第三人權益之情事者，本公司得隨時得不經通知直接加以移動、刪除或停止服務提供之權利，且不負損害賠償責任。若本公司因此受到任何損害，您應對本公司負損害賠償之責。',
      ],
    },
    {
      title: '服務暫停或中斷',
      titleDescription: [
        '本網站會員服務系統或功能例行性之維護、改置或變動所發生之服務暫停或中斷，將於該暫停或中斷前以電子郵件、公告或其他適當之方式告知會，您同意本網站不須因此負損害賠償責任。',
        '在下列情形，本網站將暫停或中斷全部或一部份之服務，且對使用者任何直接或間接之損害，均不負任何責任：',
      ],
      term: [
        {
          termTitle: '本網站或本服務相關軟硬體設備進行搬遷、更換、升級、保養或維修時。',
        },
        {
          termTitle: '使用者有任何違反政府法令或本服務條款情形。',
        },
        {
          termTitle: '天災或其他不可抗力所致之本網站或本服務停止或中斷。',
        },
        {
          termTitle: '任何不可歸責於本網站或本服務之事由所致之網站服務停止或中斷。',
        },
      ],
    },
    {
      title: '廣告',
      titleDescription: [
        '您在本網站及本服務中瀏覽到的所有廣告內容、文字與圖片之說明、展示樣品或其他銷售資訊，均由各該廣告商、產品與服務的供應商所設計與提出。您對於廣告之正確性與可信度應自行斟酌與判斷。本網站及本服務僅接受委託予以刊登，不對前述廣告負擔保責任。',
        '本網站及本服務所有頁面之相關所有權及廣告版面經營權，包括但不限於網頁最上方以及其他本網站及本服務認為適當之位置或方式所出現之橫幅式廣告、跳耀式廣告或其他形式廣告與訊息等，均仍歸本網站及本服務所有，除另行取得本網站及本服務事前同意外，會員或第三人均不得以任何方式自行或以第三人名義銷售、經營、或對第三人提供此等網路廣告或類似業務。',
      ],
    },
    {
      title: '免責聲明',
      titleDescription: [
        '對於本網站及本服務所提供之各項會員服務，均僅依該服務當時之功能及現況提供使用；對於使用者之特定要求或需求，包括但不限於速度、安全性、可靠性、完整性、正確性及不會斷線和出錯等，本網站及本服務不負任何形式或內容之擔保或保證責任。',
        '對於您所上傳的圖片或文字等資料，您應自行判斷是否適宜公開傳送至網站上，本網站會盡最大努力保證您資料的安全性，但無法保證該檔案或資料於傳送過程均係可靠且正確無誤，亦不保證所儲存的檔案或資料之安全性、可靠性、完整性、正確性及不會斷線和出錯等。',
        '對於您於本網站或本服務中所下載之電子郵件、檔案及其他資料，您應該自行考量其風險，如因下載而造成您電腦系統的損壞或電腦中資料的遺失，本網站及本服務不負任何擔保責任。',
      ],
    },
    {
      title: '智慧財產權的保護',
      titleDescription: [
        '本網站及本服務所使用之軟體或程式、網站上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計、會員內容等，均由本公司或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。任何人不得逕自使用、修改、重製、公開播送、公開傳輸、公開演出、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。',
        '若您欲引用或轉載前述軟體、程式或網站內容，除明確為法律所許可者外，必須依法取得本公司或其他權利人的事前書面同意。尊重智慧財產權是您應盡的義務，如有違反，您應對本公司及其他權利人負損害賠償責任。',
        '本網站及本服務及其相關行銷宣傳、商品、服務名稱、圖樣等（以下稱「本服務商標」），依其註冊或使用之狀態，受商標法及公平交易法等之保護，未經本公司事前書面同意，您同意不以任何方式使用本服務商標。',
      ],
    },
    {
      title: '通知',
      titleDescription: [
        '如依法或其他相關規定須為通知時，本公司得以包括但不限於：電子郵件、一般信件、簡訊、多媒體簡訊、文字訊息、張貼於本服務網頁，或其他現在或未來合理之方式通知您，包括本服務條款之變更。但若您違反本服務條款，以未經授權的方式存取本服務，您將不會收到前述通知。當您經由授權的方式存取本服務，而同意本服務條款時，您即同意本服務所為之任何及所有給您的通知，都視為送達。',
      ],
    },
    {
      title: '補償',
      titleDescription: [
        '因您經由本網站及本服務提供、張貼或傳送「會員上傳內容」、使用本服務、與本網站及本服務連線、違反本服務條款、或侵害其他人任何權利所衍生或導致任何第三人為請求或主張時，您同意使本公司、本網站及本服務、經理人、代理人、受僱人、合夥人及授權人免於任何損害。',
      ],
    },
    {
      title: '不得為商業利用',
      titleDescription: [
        '您同意不對本網站及本服務任何部分或本網站及本服務（包括：會員內容、廣告、軟體及帳號等）之使用或存取，進行重製、拷貝、出售、交易、轉售或作任何商業目的之使用。',
      ],
    },
    {
      title: '服務變更及服務條款之修正',
      titleDescription: [
        '基於網站的運作，會員服務有可能停止提供服務之全部或一部，使用者不可以因此而要求任何賠償或補償。本公司保留隨時修改本服務條款的權利，並將修改後的條款公布於網站上，您同意於網站上閱讀不需另行通知，如涉及對會員權益重大影響之條款，本公司將依會員留存之電子郵件為通知，並於通知所載之日期生效。',
        '本公司所訂之任何服務條款之全部或部份無效時，不影響其他有效條款之效力。如果您違反了本服務條款，本公司保留隨時暫時停止提供服務、或終止提供服務之權利，您不可以因此而要求任何賠償或補償。',
        '您同意本公司得隨時修改本條款之內容；修改之內容一經公告於本服務網站且您繼續使用本服務時，視為您已經同意修改之內容。',
        '您同意本公司有權隨時終止或修改本服務之全部或一部，並得以公告或電子郵件通知您終止或修改之內容。',
      ],
    },
    {
      title: '準據法及管轄權',
      titleDescription: [
        '本約定條款解釋、補充及適用均以中華民國法令為準據法。因本約定條款所發生之訴訟，除法律另有規定者外，以台灣台北地方法院為第一審管轄法院。',
      ],
    },
  ];
};

export const privacyPolicy = () => {
  return [
    {
      titleDescription: [
        '非常感謝您參觀解鎖平台www.unlocking.today（以下稱本網站）及本公司後續所推出之相關服務網站，以上服務統稱為「Unlocking.Today解鎖平台服務」（以下稱本服務），並由「愛特盟科技有限公司」（以下稱本公司）所經營。',
        '解鎖平台非常重視您的隱私權，為了幫助您瞭解本網站如何蒐集、處理及利用會員所提供的個人資料以及會員就個人資料所享有的權利，請詳細閱讀本隱私權政策。',
      ],
    },
    {
      title: '適用範圍',
      term: [
        {
          termTitle:
            '您在本網站活動時，所涉及的個人資料蒐集、處理與相關利用行為，均受到本隱私權政策之保護。基於對會員權益的維護及尊重，本網站對於個人資料之蒐集、處理及利用，將以誠實及信用方法為之，除有法律特別規定外，不會逾越特定目的之必要範圍，並與蒐集之目的具有正當合理之關聯。',
        },
        {
          termTitle:
            '本隱私權政策僅適用於本網站及本網站所委託或參與蒐集、處理及利用的個人資料，會員透過本網站相關連結但非屬本網站所委託或參與管理之網站所提供之個人資料，並不適用本隱私權政策之規定。',
        },
        {
          termTitle:
            '當您向本網站註冊時，本網站會搜集並儲存您主動提供之電子郵件信箱。其餘個人資料之搜集方式，請詳閱以下資訊：',
        },
      ],
    },
    {
      title: '個人資料之蒐集、處理及利用之告知',
      titleDescription: [
        '本公司為了確保會員之個人資料、隱私及消費者權益之保護，於交易過程中將使用會員之個人資料，謹依個人資料保護法第8條規定告知以下事項：',
      ],
      term: [
        {
          termTitle: '蒐集主體：愛特盟科技有限公司',
        },
        {
          termTitle: '蒐集之目的：',
          termDescription: [
            '本公司蒐集之目的包括行銷、契約、類似契約或其他法律關係事務、消費者、客戶管理與服務、消費者保護、網路購物及其他電子商務服務、統計與研究分析，及其他經營合於營業登記項目或組織章程所定之業務。本公司將在會員之加入會員之流程、進行交易之流程，及閱讀、瀏覽網頁過程中，進行資料之蒐集。',
          ],
        },
        {
          termTitle: '當您造訪本網站或使用本服務時，我們可能會蒐集您的個人資料包括但不限於以下：',
          termContent: [
            '個人辨識（例如：姓名、住址、電子郵件信箱、行動電話、社群帳號）。',
            '個人描述（例如：出生年月日、性別）。',
            '財務辨識（例如：信用卡或簽帳卡之號碼、銀行帳戶之號碼與姓名）。',
            '財務交易（例如：收付金額、支付方式）。',
            '安全細節（例如：密碼）。',
            '電腦與行動應用裝置之資料，含軟硬體規格、裝置辨識資料、IP 位址、Cookie 與裝置地理位置。',
            '未分類之資料（例如：課程發問、備註、無法歸類之檔案、報告、留言、評論）。',
            '本公司系統因您登入、使用閱讀軟體等所自動蒐集之資料（如 職業、教育程度、有無子女、有興趣的主題（例如：文學、科學、旅遊、等等）。',
            '其他：常用的社交平台、或常用的購物網站、或常去的零售實體通路等。',
          ],
        },
        {
          termTitle: '個人資料利用之期間、地區、對象及方式',
          termContent: [
            '期間：本公司營運期間。',
            '地區：會員之個人資料將用於台灣地區及本公司伺服器、備援伺服器所在地區。',
            '利用對象及方式：您的個人資料僅於利用目的必要範圍內供本公司及協力廠商以電子或紙本方式處理及利用，並將不會提供予任何無關之第三人。',
          ],
        },
      ],
    },
    {
      titleDescription: [
        '如您拒絕提供本服務所需必要之資料，將可能導致無法享受完整服務或完全無法使用該項服務。',
      ],
      term: [
        {
          termTitle:
            '除符合特定目的之利用外，本公司將不會出售、交換、或出租任何會員的個人資料給其他團體或個人。但符合下列情況時不在此限：',
          termContent: [
            '您以書面同意分享資訊時。',
            '會員行為已明顯違反本網站政策，或有損害或妨礙本公司權益，或導致任何人遭受損害之虞時，為了進行身份辨識、聯絡或採取法律行動所必要時。',
            '為符合法律或依法律授權之命令所要求時。',
            '基於公共利益之考量而有必要時。',
          ],
        },
        {
          termTitle:
            '為防止會員的資料被竊取、竄改、毀損、滅失或洩漏，伺服器會自動在會員瀏覽本網站及進行交易時保存紀錄及軌跡資料，包括使用連線設備的IP位址、使用時間、使用的瀏覽器、瀏覽及點選資料記錄等。如果您在本網站上進行交易，我們也會留存您的買賣紀錄及其他您所提供的意見，做為進行數據統計分析的依據及增進網站服務的參考，所留存記錄僅供內部使用，不對外公布。',
        },
        {
          termTitle:
            '本公司可能透過 Facebook 或類似社群服務系統，於取得您的同意後，將部分本網站的資訊發布於您的社群活動資訊頁面，若您不同意該等訊息之發布，請您勿點選同意鍵，或於事後透過各該社群服務之會員機制移除該等資訊或拒絕本網站繼續發布相關訊息。若有任何問題，仍可與本公司聯絡，本公司將協助您確認、處理相關問題。',
        },
        {
          termTitle:
            '當本公司或本網站全部或部分分割、獨立子公司經營、被其他第三者購併或收購資產，導致經營權轉換時，本公司會於事前將相關細節公告於本網站，且本公司或本網站所擁有之全部或部分使用者資訊亦可能在經營權轉換的狀況下移轉給第三人。惟限於與該經營權轉換服務相關之個人資料。若本公司或本網站部分營運移轉予第三人，您仍為本公司會員，若您不希望本公司後續利用您的個人資料，您可以依本隱私權政策向本公司行使權利。',
        },
      ],
    },
    {
      title: 'Cookie／Web Storage',
      titleDescription: [
        'Cookie是伺服端為了區別使用者的不同喜好，經由瀏覽器寫入使用者端裝置的一些簡短資訊；Web Storage（本機端儲存）與Cookie相似，可經由瀏覽器將資料寫入使用者端的裝置。',
        '會員可以在Firebox的「偏好設定」的「個人隱私」或是Chrome的「設定」進入「進階設定」中的「隱私權說明」、Safari中「偏好設定」中的「隱私權」，或IE的「Internet選項」的「安全性中選擇修改瀏覽器對cookie的接受程度，各瀏覽器對cookie皆有不同接受程度之設定，但如果您選擇拒絕所有的cookie，可能會無法使用部份個人化服務，或是參與部份的活動。',
        '依據以下目的及情況，在本政策原則之下，在會員的瀏覽器中寫入並讀取cookie：',
      ],
      term: [
        {
          termTitle:
            '為提供更好的個人化服務，以及方便會員參與個人化的互動活動。cookie在註冊、登入時建立，並在登出時修改。',
        },
        {
          termTitle:
            '為統計瀏覽人數及分析瀏覽模式，以了解網頁瀏覽的情況，做為本網站改善服務的參考。',
        },
      ],
    },
    {
      title: '您就個人資料的權利',
      term: [
        {
          termTitle: '依法就您的個人資料您有下列權利：',
          termContent: [
            '請求提供查詢或閱覽。',
            '請求製給複製本。',
            '請求補充缺漏或更正錯誤。',
            '請求停止蒐集、處理或利用。',
            '請求刪除。',
          ],
        },
        {
          termTitle:
            '如會員申請前列(1)或(2)之服務時，本公司將於十五日內提供，必要時得延長十五日並以書面說明原因，但有下列情形者得不予提供：',
          termContent: [
            '有妨害國家安全、外交及軍事機密、整體經濟利益或其他國家重大利益之虞時。',
            '有妨害公務機關執行法定職務之虞時。',
            '妨害本公司或第三人之重大利益之虞時。',
          ],
        },
        {
          termTitle:
            '如會員申請第1條(3)到(5)之服務時，本公司將於申請後三十日內提供，必要時得延長三十日並以書面說明原因，但有下列情形者得不予提供：',
          termContent: ['因本公司執行業務或履行法定義務所必須者。', '經會員書面同意者。'],
        },
        {
          termTitle:
            '您如欲申請上述服務，得隨時以電子郵件通知本公司客服（support@unlocking.today），客服人員於收到您的來信後，會以電子郵件確認您的會員身分，完成確認程序後，即完成申請，如需收取相關成本費用，客服人員將會通知您，本公司於您支付該等費用後，會依個人資料保護法規定處理。',
        },
      ],
    },
    {
      title: '您修改及刪除個人帳號資料及偏好設定的能力',
      titleDescription: [
        '您可隨時修改個本網站帳號資料和數位閱讀偏好。',
        '本網站可能會不定時在閱讀偏好設定頁面上新增新類別訊息。瀏覽此頁面的使用者可選擇退出接收新類別訊息，或按照所收訊息中的指示取消訂閱這些訊息。我們保有權利向您傳送本網站服務相關的特定訊息（如服務公告、管理訊息），這些訊息被視為您本網站帳號的一部分，您無法選擇退出接收。',
        '如果您要刪除您的本網站帳號，請與我們聯繫（support@unlocking.today）。',
      ],
    },
    {
      title: '您就個人資料之保密協力義務',
      term: [
        {
          termTitle:
            '凡是透過網站討論區、電子郵件、或聊天室等公開區域所主動揭露的個人資料，均可能被第三人蒐集或使用，請您妥善維護帳號、密碼或任何個人資料。',
        },
        {
          termTitle:
            '如會員自行於本網站公開區域揭露帳號、密碼或任何個人資料，致資料被竊取、洩漏、竄改或發生其他侵害者，本公司並無查明、通知的義務，亦不負害賠償責任。',
        },
      ],
    },
    {
      title: '資料保護',
      titleDescription: [
        '本公司之員工，僅於其為您提供產品或服務之需求範圍內，對於您的個人資料得為有限之接觸。本網站主機均設有防火牆、重要個資加密等相關的各項資訊安全設備及必要的安全防護措施，保護網站及會員的個人資料。',
      ],
    },
    {
      title: '隱私權保護政策修訂',
      titleDescription: [
        '本網站可不時修訂本政策。當我們在個人資料的處理上有重大變更時，會將通知傳送到您在本網站帳號中指定的主要電子郵件地址，或在我們的網站上張貼告示，若您不同意該等變更或修改，請停止繼續使用本網站服務，並依本隱私權政策規定通知本公司停止蒐集、處理及利用您的個人資料。',
      ],
    },
    {
      title: '問題和建議',
      titleDescription: [
        '如果您有任何問題或建議，請透過客服信箱（support@unlocking.today）與我們聯繫。\n',
      ],
    },
  ];
};

export const disclaimer = () => {
  return [
    {
      titleDescription: [
        '本平台所傳播或刊載之內容，其所展現的文字、圖片、動畫、聲音、影像、連結或以其他方式所為之說明，均係由內容提供者或該課程講師所自行提供，其所載之資訊及材料如涉及醫療方式、療效或其他功能時，該等資訊及材料不可擬作為或取代專業醫療意見或診斷，倘因此產生任何誤解或糾紛時，本平台對此不負任何擔保責任。',
      ],
    },
  ];
};

export const aboutUs = () => {
  return `
    <p class="mt-5 lg:mt-0">這是一座知識的「解鎖山海經」。有聲書、電子書、課程、影片 — 各路內容神獸在此集結！</p>
    <p>Unlocking.today 不只是數位出版平台，我們是「現代藏經閣」＋「未來百科全書」。</p>
    <p>中國文化、世界思想，古老智慧、AI 小書僮，全都在這裡相遇！</p>
    <p class="mt-5 font-bold"">我們的信念：讓每一份內容都能穿越時空，被更多人聽見與理解。</p>
    <p class="mt-5">一起打造你自己的內容宇宙：<a href="https://www.unlocking.today" class="font-bold color-secondary underline">www.unlocking.today</a></p>
    <p class="mt-5 font-bold">歡迎聯絡我們</p>
    <p>客服信箱：support@unlocking.today</p>
    <p>客服時間：週一至週五 10:00–18:00（國定假日除外）</p>
    <p class="mb-[30px]">官方網站：<a href="https://www.unlocking.today" class="font-bold color-secondary underline">www.unlocking.today</a></p>
`;
};

export const security = () => {
  return `
    <div class="w-full flex justify-center items-center">
       <img src="https://d3gwkvew0jd6kn.cloudfront.net/aws-security-certificate.webp" alt="security" class="max-w-[600px]"/>
    </div>
`;
};
